Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes Constructor
 Creates a new mark symbol attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkBasicSymbolAttributes()
Public Sub New
See Also
Reference
ViewMarkBasicSymbolAttributes Class
ViewMarkBasicSymbolAttributes Overload
Tekla.Structures.Drawing Namespace